# St7GetTotalReinforcementLayouts

Returns the total number and highest ID number of the concrete reinforcement layouts in the specified model.

long St7GetTotalReinforcementLayouts(long uID, long* NumLayouts,

long* LastLayout)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumLayouts

The number of layouts.

LastLayout

The highest layout ID.